auctionApp/app/views/pages/yourAuction.html.erb

        <td><%= auction.current_bidding %></td>
        <td><%= image_tag(Collectible.find(auction.collectible_id).img, size: "200x200", alt: "Collectible Image")%></td>
---
SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]