auctionApp/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."id" ASC
---
  def index
    @auctions = Auction.all

SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @auction = Auction.new
    @collectible = Collectible.find(params[:collectible_id])

SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "collectibles" SET "current_bid" = $1, "updated_at" = $2 WHERE "collectibles"."id" = $3  [["current_bid", 4], ["updated_at", "2019-07-22 10:51:47.018349"], ["id", 10]]
INSERT INTO "auctions" ("collectible_id", "previous_bidding", "current_bidding", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["collectible_id", 1], ["previous_bidding", 50], ["current_bidding", 120], ["created_at", "2019-07-22 07:29:13.868217"], ["updated_at", "2019-07-22 07:29:13.868217"], ["user_id", 2]]
---
  def create
    @auction = current_user.auctions.new(auction_params)
    collectible = Collectible.find(@auction.collectible_id)
    if @auction.current_bidding > @auction.previous_bidding
        collectible.update_attribute(:current_bid, @auction.current_bidding )
        respond_to do |format|
            if @auction.save

DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 9]]
---
  def destroy
    @auction.destroy

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_auction
      @auction = Auction.find(params[:id])