auctionApp/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."collectible_id" ASC
---
  def index
    @auctions = Auction.all.order(:collectible_id)

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
    def set_auction
      @auction = Auction.find(params[:id])