auctionApp/app/controllers/collectibles_controller.rb

  def index
    @collectibles = Collectible.all
---
SELECT "collectibles".* FROM "collectibles" ORDER BY "collectibles"."id" ASC

  def create
    @collectible = current_user.collectibles.new(collectible_params)

    respond_to do |format|
      if @collectible.save
---
INSERT INTO "collectibles" ("name", "img", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["img", ""], ["created_at", "2019-07-23 13:16:42.609864"], ["updated_at", "2019-07-23 13:16:42.609864"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @collectible.update(collectible_params)
---
UPDATE "collectibles" SET "name" = $1, "mintage" = $2, "current_bid" = $3, "updated_at" = $4 WHERE "collectibles"."id" = $5  [["name", "1917 George V "], ["mintage", 1000], ["current_bid", 5000], ["updated_at", "2019-07-23 13:11:27.362368"], ["id", 10]]

  def destroy
    if current_user.id == @collectible.user_id
        @collectible.destroy
---
DELETE FROM "collectibles" WHERE "collectibles"."id" = $1  [["id", 8]]

    def set_collectible
      @collectible = Collectible.find(params[:id])
---
SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]