auctionApp/app/views/auctions/index.html.erb

SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
        <td><%= auction.current_bidding %></td>
        <td><%= image_tag(Collectible.find(auction.collectible_id).img, size: "200x200", alt: "Collectible Image")%></td>