auctionApp/app/views/auctions/show.html.erb

SELECT  "collectibles".* FROM "collectibles" WHERE "collectibles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  <strong></strong>
  <%= image_tag(Collectible.find(@auction.collectible_id).img, size: "200x200", alt: "Collectible Image")%>